Repository: kodi-game/game.libretro.mgba
Catalog: game.libretro.mgba/resources/language/resource.language.*/strings.po
Languages: es_mx, ga

# Addon Description
source: mGBA aims to be faster and more accurate than many existing Game Boy Advance emulators, as well as adding features that other emulators lack.
ga: Tá sé mar aidhm ag mGBA a bheith níos tapúla agus níos cruinne ná go leor aithriseoirí Game Boy Advance atá ann cheana féin, chomh maith le gnéithe a chur leis nach bhfuil ag aithriseoirí eile.

# #30001
source: Game Boy Model (Restart)
ga: Múnla Game Boy (Atosaigh)

# #30002
source: Use BIOS File if Found (Restart)
ga: Úsáid Comhad BIOS má aimsítear é (Atosaigh)

# #30003
source: Skip BIOS Intro (Restart)
ga: Léim an Réamhrá BIOS (Atosaigh)

# #30004
source: Default Game Boy Palette
ga: Pailéad Réamhshocraithe Game Boy

# #30005
source: Hardware Preset Game Boy Palettes (Restart)
ga: Pailéid Réamhshocraithe Crua-earraí Game Boy (Atosaigh)

# #30006
source: Use Super Game Boy Borders (Restart)
ga: Úsáid Teorainneacha Super Game Boy (Atosaigh)

# #30007
source: Color Correction
ga: Ceartú Dath

# #30008
source: Interframe Blending
ga: Cumasc Idirfhráma

# #30009
source: Audio Filter
ga: Scagaire Fuaime

# #30010
source: Audio Filter Level
ga: Leibhéal Scagaire Fuaime

# #30011
source: Allow Opposing Directional Input
ga: Ceadaigh Ionchur Treorach Os Coinne

# #30012
source: Solar Sensor Level
ga: Leibhéal Braiteora Gréine

# #30013
source: Game Boy Player Rumble (Restart)
ga: Rumble Imreoir Game Boy (Atosaigh)

# #30014
source: Idle Loop Removal
ga: Baineadh Lúb Díomhaoin

# #30015
source: Frameskip
ga: Fráma-léim

# #30016
source: Frameskip Threshold (%)
ga: Tairseach Léim Fráma (%)

# #30017
source: Frameskip Interval
ga: Eatramh Léim Fráma

# #30000
source: Settings
es_mx: Ajustes

# #30001
source: Solar Sensor Level
es_mx: Nivel de sensor solar

# #30002
source: Allow Opposing Directional Input
es_mx: Permitir entrada direccional opuesta

# #30003
source: Game Boy Model (requires restart)
es_mx: Modelo de Game Boy (requiere reiniciar)

# #30004
source: Use BIOS File if Found (requires restart)
es_mx: Utilizar archivo de BIOS si se encuentra (requiere reiniciar)

# #30005
source: Skip BIOS Intro (requires restart)
es_mx: Saltar Intro del BIOS (requiere reiniciar)

# #30006
source: Use Super Game Boy Borders (requires restart)
es_mx: Utilizar Bordes del Super Game Boy (requiere reiniciar)

# #30007
source: Idle Loop Removal
es_mx: Remoción de bucle en reposo

# #30008
source: Frameskip
es_mx: Saltar cuadros

# #30009
source: Frameskip Threshold (%)
es_mx: Porcentaje (%) de salto de cuadros

# #30010
source: Frameskip Interval
es_mx: Intervalo de salto de cuadros

# #30011
source: Color Correction
es_mx: Corrección de color

# #30012
source: Interframe Blending
es_mx: Mezcla entre cuadros

# #30013
source: Enable Game Boy Player Rumble (requires restart)
es_mx: Activar Game Boy Player Rumble (requiere reiniciar)
